{
  "domain": "piano",
  "ge_sample_count": 30,
  "tips_sample_count": 0,
  "total_sample_count": 30,
  "ge_samples": [
    {
      "take_name": "upenn_0726_Piano_2_5",
      "recording": "1.webm",
      "video_time": 144.2248,
      "duration_approx": 16.73670000000298,
      "task_name": "Playing Piano",
      "sorted_video_times": [
        142.984986,
        144.2248,
        151.504999,
        162.589383,
        164.304815
      ],
      "correct_ratio": 0.3,
      "GT": "The pianist demonstrates graceful hand crossing, landing on the next spot on the keyboard with pitch accuracy and maintaining a nice smooth and legato sound.",
      "negative_comments": [
        "The pianist demonstrates graceful elbow bending, ensuring each note is hit with pitch accuracy and maintaining a nice sharp and staccato sound.",
        "The pianist demonstrates graceful finger tapping, landing on the next spot on the keyboard with pitch accuracy and maintaining a nice smooth and percussive sound.",
        "The pianist uses subtle pedal adjustments to execute the hand crossings with clarity and smoothness.",
        "By adjusting the height of their music stand, the pianist ensures better control over the tempo during hand crossings."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0717_Piano_1_4",
      "recording": "31.webm",
      "video_time": 550.734135,
      "duration_approx": 13.168,
      "task_name": "Playing Piano - Freeplaying",
      "sorted_video_times": [
        31.606426,
        32.55684,
        33.742649,
        34.890558,
        35.992203,
        42.727772,
        53.995138,
        88.516172,
        103.769464,
        148.358758,
        168.658215,
        168.729661,
        210.906527,
        233.205163,
        290.988778,
        365.063571,
        433.823574,
        496.070325,
        531.481095,
        537.789841,
        543.64481,
        549.986193,
        550.734135,
        557.030336,
        632.191347
      ],
      "correct_ratio": 0.2,
      "GT": "The participant exhibits perfect musicality, demonstrating a wonderful musical phrase with effective use of gestures, ebb and flow, decrescendos, and crescendos.",
      "negative_comments": [
        "The participant exhibits perfect musicality, demonstrating a wonderful musical phrase with effective use of staccato notes, ebb and flow, decrescendos, and crescendos.",
        "The participant shows perfect musicality, illustrating a wonderful musical phrase with effective use of gestures and abrupt tempo changes.",
        "The participant expertly employs glissandos throughout the phrase to enhance the musicality and convey the intended emotion.",
        "By incorporating a variety of pedal techniques, the participant creates a compelling musical narrative that captivates the audience."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0701_Piano_3_3",
      "recording": "0.webm",
      "video_time": 20.157161,
      "duration_approx": 33.41880000000074,
      "task_name": "Playing Piano - Suzuki Books",
      "sorted_video_times": [
        20.157161,
        48.918949,
        57.355439,
        71.415047,
        93.821143,
        106.48369,
        161.008627,
        167.696633,
        182.030322,
        195.942236,
        228.391853,
        244.629474
      ],
      "correct_ratio": 0.2,
      "GT": "The expert appreciates that the participant is focusing on isolating and examining the right hand's part, ensuring not to rush through the exercise.",
      "negative_comments": [
        "The expert notes that the participant is focusing on isolating and examining the left hand's part, ensuring not to rush through the exercise.",
        "The expert appreciates that the participant is meticulously accelerating through the exercise to build finger strength.",
        "The expert observes that the participant is switching between using the sustain pedal to isolate individual notes during the exercise.",
        "The expert points out that the participant demonstrates careful attention by adjusting the stool height between repetitions to improve posture."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0701_Piano_3_5",
      "recording": "10.webm",
      "video_time": 182.526402,
      "duration_approx": 16.79260000000149,
      "task_name": "Playing Piano",
      "sorted_video_times": [
        49.216368,
        70.323751,
        73.26649,
        79.31456,
        81.325191,
        82.558442,
        89.312833,
        100.550848,
        100.799607,
        110.822986,
        111.896532,
        119.193828,
        180.774963,
        182.526402,
        196.67648,
        207.647496
      ],
      "correct_ratio": 0.3,
      "GT": "The participant effectively demonstrates the technique of using the tips of her fingers to play, with her hands being very curved. This technique allows for greater control while playing the piano.",
      "negative_comments": [
        "The participant effectively demonstrates the technique of using the pads of her fingers to play, with her hands being slightly flat. This technique allows for greater control while playing the piano.",
        "The participant effectively demonstrates the technique of using her wrist to lead the motion, with her hands being very curved. This technique allows for greater control while playing the piano.",
        "The participant effectively demonstrates the technique of using her forearm to directly initiate key strikes, with each hand movement smooth and calculated.",
        "The participant effectively demonstrates the technique of adjusting her elbow height constantly, which is crucial for maintaining the tempo during fast passages."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0701_Piano_1_2",
      "recording": "0.webm",
      "video_time": 13.334382,
      "duration_approx": 18.7725,
      "task_name": "Playing Piano - Scales and Arpeggios",
      "sorted_video_times": [
        13.334382
      ],
      "correct_ratio": 0.3,
      "GT": "The participant executes wrist rolling well to transfer the balance in their hands while ascending up the keyboard.",
      "negative_comments": [
        "The participant executes finger curling well to transfer the balance in their hands while ascending up the keyboard.",
        "The participant executes elbow lifting well to transfer the balance in their hands while ascending up the keyboard.",
        "The participant applies the use of heel tapping for additional rhythm control while ascending up the keyboard.",
        "The participant focuses on vocalizing each note out loud to maintain balance while ascending up the keyboard."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0717_Piano_2_3",
      "recording": "4.webm",
      "video_time": 214.986011,
      "duration_approx": 11.742599999999628,
      "task_name": "Playing Piano - Suzuki Books",
      "sorted_video_times": [
        60.12663,
        65.564074,
        78.29362,
        101.936902,
        114.982642,
        133.210065,
        138.184802,
        200.250068,
        212.082934,
        214.986011,
        221.228702,
        252.671612,
        256.901335,
        279.785395,
        292.622677
      ],
      "correct_ratio": 0.3,
      "GT": "The participant does a really nice job of maintaining a low center of gravity with their left hand, resulting in very fluid playing.",
      "negative_comments": [
        "The pianist demonstrates great technique, notably playing with their knuckles leading the motion to enable more efficient hand movement.",
        "The pianist maintains a firm wrist to facilitate smooth legato phrasing throughout the passage.",
        "The pianist uses quick forearm rotation to execute the trills with clarity and ease.",
        "By shifting their bench position forward, the pianist ensures better control over dynamic contrast."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0701_Piano_2_4",
      "recording": "3.webm",
      "video_time": 159.388167,
      "duration_approx": 5.704700000002981,
      "task_name": "Playing Piano - Suzuki Books",
      "sorted_video_times": [
        26.51975,
        30.386039,
        35.105325,
        80.443638,
        87.01435,
        104.02445,
        115.141998,
        159.388167,
        195.782702,
        252.806731,
        294.273778
      ],
      "correct_ratio": 0.2,
      "GT": "The expert notes that the fingerings in the right hand are executed well.",
      "negative_comments": [
        "The expert notes that the pedal techniques in the right hand are executed well.",
        "The expert highlights how the left hand fingerings are executed well.",
        "The expert notes that the use of body weight shifts makes the chords in the right hand more expressive.",
        "The expert comments on the excellent use of wrist rotation in the right hand to increase velocity."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0721_Piano_2_2",
      "recording": "10.webm",
      "video_time": 152.145105,
      "duration_approx": 12.982100000000559,
      "task_name": "Playing Piano - Scales and Arpeggios",
      "sorted_video_times": [
        9.638166,
        15.195112,
        16.806548,
        23.615559,
        24.192636,
        27.348655,
        30.800145,
        32.321743,
        42.273821,
        57.606096,
        66.234739,
        72.792223,
        74.655061,
        79.248809,
        110.469095,
        139.797114,
        146.23376,
        148.345772,
        152.145105,
        173.286358,
        175.122125,
        206.380247,
        238.428718,
        243.573149
      ],
      "correct_ratio": 0.2,
      "GT": "The participant effectively contracts and then expands their hand to play arpeggios at a fast speed.",
      "negative_comments": [
        "The participant effectively curls their fingers to maintain a strong grip while moving through arpeggios at a fast speed.",
        "The participant taps their fingers individually on the keys to emphasize the arpeggios' rhythm at a fast speed.",
        "The participant uses their elbow movement to smoothly transition between the octaves in the arpeggios.",
        "By adjusting their bench height midway, the participant achieves a more resonant tone throughout the arpeggios."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0722_Piano_2_5",
      "recording": "9.webm",
      "video_time": 215.565394,
      "duration_approx": 16.56290000000596,
      "task_name": "Playing Piano",
      "sorted_video_times": [
        73.614124,
        75.178733,
        78.238714,
        78.581902,
        95.323756,
        110.843548,
        160.805431,
        164.239854,
        175.180577,
        190.786973,
        213.520254,
        215.565394,
        240.66661,
        248.477188,
        251.235726,
        285.17255,
        292.235765,
        312.39317,
        335.68337,
        336.254326,
        337.511807,
        354.48735
      ],
      "correct_ratio": 0.2,
      "GT": "The participant has a good understanding of when to move their hands forward and back on the keyboard.",
      "negative_comments": [
        "The participant has a good understanding of when to move their elbows forward and back on the keyboard.",
        "The participant shifts their fingers sideways to navigate the keyboard effectively.",
        "The participant stays stationed at the lower end of the keyboard to maintain a consistent rhythm.",
        "The participant uses the pedal extensively to enhance the tonal quality in this piece."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0719_Piano_2_5",
      "recording": "15.webm",
      "video_time": 419.745466,
      "duration_approx": 23.41210000000149,
      "task_name": "Playing Piano - Freeplaying",
      "sorted_video_times": [
        46.881113,
        52.194687,
        53.213585,
        57.137673,
        61.297895,
        64.638412,
        67.032574,
        72.559246,
        90.46836,
        92.658237,
        95.938089,
        100.334139,
        140.997556,
        144.796041,
        161.173547,
        189.686536,
        192.843534,
        193.432573,
        194.202487,
        195.380492,
        220.560684,
        220.732638,
        232.015243,
        246.646086,
        248.945219,
        252.377745,
        275.460094,
        275.460094,
        275.529579,
        359.531874,
        359.689241,
        364.411789,
        415.361724,
        419.745466,
        441.071954,
        441.087094,
        443.274264,
        456.169116,
        464.273502,
        519.816579
      ],
      "correct_ratio": 0.3,
      "GT": "The participant successfully shows contrast between two kinds of accents, demonstrating how the amount of vertical motion in the hand affects the sound.",
      "negative_comments": [
        "The participant successfully shows contrast between two kinds of accents, demonstrating how the amount of horizontal motion in the hand affects the sound.",
        "The participant successfully shows contrast between staccato and legato styles, demonstrating how the amount of vertical motion in the hand affects the sound.",
        "The participant varies the sound quality by manipulating the pedal, demonstrating how different levels of sustain can affect the overall tone.",
        "The participant focuses on finger independence, demonstrating contrast in dynamics by varying the finger pressure on each key."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0719_Piano_2_4",
      "recording": "16.webm",
      "video_time": 325.477825,
      "duration_approx": 14.386,
      "task_name": "Playing Piano - Freeplaying",
      "sorted_video_times": [
        27.601485,
        27.637347,
        28.077375,
        38.543629,
        50.497781,
        58.53681,
        71.463424,
        76.775355,
        114.867153,
        119.25076,
        128.220682,
        131.235547,
        135.473823,
        167.655044,
        191.523715,
        195.332551,
        205.608002,
        224.686435,
        237.499466,
        241.486455,
        250.448577,
        285.080803,
        300.786435,
        302.383963,
        303.69352,
        325.477825,
        326.792129,
        329.324096,
        333.001989,
        371.078765,
        395.094621,
        408.798455,
        417.164761,
        427.699074,
        444.08077,
        460.720528,
        488.256873,
        508.859891,
        514.205329,
        526.935996,
        559.177831,
        559.701327,
        584.311277,
        599.733382,
        612.005432,
        618.381049,
        652.727479,
        680.139476,
        686.585862,
        701.174277,
        773.480923,
        827.089012,
        858.770693
      ],
      "correct_ratio": 0.2,
      "GT": "The participant effectively plays louder for an impassioned effect and lifts their fingers higher off of the keys to increase volume.",
      "negative_comments": [
        "The participant effectively plays quieter for an impassioned effect and lifts their fingers higher off of the keys to decrease volume.",
        "The participant effectively plays louder for a calming effect and keeps their fingers close to the keys to increase volume.",
        "The participant effectively uses the sustain pedal throughout the passage to increase volume without changing finger technique.",
        "The participant employs rapid finger tapping on the keys to enhance the percussive effect and increase volume."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0719_Piano_1_3",
      "recording": "12.webm",
      "video_time": 235.707208,
      "duration_approx": 9.225299999999814,
      "task_name": "Playing Piano - Suzuki Books",
      "sorted_video_times": [
        32.065678,
        235.707208
      ],
      "correct_ratio": 0.2,
      "GT": "The participant demonstrates a good balance between hands, maintains even tempo, and makes no mistakes.",
      "negative_comments": [
        "The pianist demonstrates a good balance between hands, maintains even tempo, and switches frequently between crossing over and under with their fingers.",
        "The pianist shows excellent rhythm but primarily leans on using their elbows to produce the melody.",
        "The pianist frequently uses their back to anticipate the dynamics, which helps maintain an even tempo throughout.",
        "By constantly adjusting the pedal with their left foot, the pianist ensures no mistakes are made during the performance."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0726_Piano_1_5",
      "recording": "8.webm",
      "video_time": 229.04133,
      "duration_approx": 18.642900000002236,
      "task_name": "Playing Piano - Suzuki Books",
      "sorted_video_times": [
        12.75295,
        17.149698,
        31.459215,
        40.298727,
        54.041045,
        54.630571,
        64.558558,
        64.619309,
        64.745148,
        66.610037,
        72.425807,
        101.757396,
        106.541223,
        111.526348,
        112.994232,
        113.359687,
        162.039617,
        176.251314,
        181.57435,
        229.04133,
        240.474334,
        241.5298,
        256.138911,
        269.957593,
        270.843234,
        296.04621,
        307.728002,
        307.807636
      ],
      "correct_ratio": 0.3,
      "GT": "The participant demonstrates an excellent leap from the thumb to the pinky, showcasing an excellent use of weight transfer and knowledge of technique on the instrument.",
      "negative_comments": [
        "The participant demonstrates an excellent leap from the index finger to the ring finger, showcasing an excellent use of weight transfer and knowledge of technique on the instrument.",
        "The participant shows a smooth slide from the thumb to the pinky, showcasing an exceptional use of weight transfer and knowledge of technique on the instrument.",
        "The participant demonstrates remarkable sliding of the hand across the keys, showcasing an excellent use of gliding technique and understanding of melodic flow.",
        "By employing alternation between the middle and ring finger, the participant displays a sophisticated grasp of tension release and hand positioning."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0719_Piano_2_2",
      "recording": "0.webm",
      "video_time": 10.28898,
      "duration_approx": 9.87,
      "task_name": "Playing Piano - Scales and Arpeggios",
      "sorted_video_times": [
        10.28898,
        11.079426,
        11.770125,
        15.913231,
        17.204289,
        20.114146,
        22.354655,
        25.478838,
        37.350016,
        39.598888,
        44.721034,
        77.424881,
        80.894986,
        91.977781,
        112.15109,
        130.738322,
        174.104371,
        192.646742
      ],
      "correct_ratio": 0.3,
      "GT": "The pianist is performing a major scale at a fast challenging tempo with great pitch accuracy and excellent finger crossing technique.",
      "negative_comments": [
        "The pianist is performing a minor scale at a fast challenging tempo with great pitch accuracy and excellent finger crossing technique.",
        "The pianist is maintaining consistent pedal engagement throughout the performance to achieve great pitch accuracy.",
        "The pianist uses their elbow to guide hand movements during the performance, enhancing finger speed.",
        "By incorporating sudden dynamic changes, the pianist adds dramatic expression to the scale performance."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0720_Piano_1_2",
      "recording": "2.webm",
      "video_time": 32.131038,
      "duration_approx": 8.93029999999702,
      "task_name": "Playing Piano - Scales and Arpeggios",
      "sorted_video_times": [
        28.031067,
        32.131038,
        37.267584,
        46.3728,
        54.824262,
        123.947005,
        205.15794
      ],
      "correct_ratio": 0.2,
      "GT": "The participant makes great use of their core body to assist and guide their hands up the keyboard.",
      "negative_comments": [
        "The participant makes great use of their arms to assist and guide their hands up the keyboard.",
        "The participant utilizes their shoulders to assist and guide their hands down the keyboard.",
        "The participant expertly changes sitting posture to guide their hands up the keyboard.",
        "By adjusting their elbow height, the participant ensures smooth hand movement up the keyboard."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0726_Piano_1_4",
      "recording": "7.webm",
      "video_time": 105.383788,
      "duration_approx": 12.34180000001192,
      "task_name": "Playing Piano - Freeplaying",
      "sorted_video_times": [
        19.690927,
        25.591301,
        29.781541,
        49.526667,
        64.809288,
        76.079334,
        78.736358,
        83.843201,
        88.864673,
        96.715567,
        98.470578,
        105.383788,
        109.73832,
        120.49406,
        122.160568,
        133.716163,
        143.475653,
        180.006567,
        184.201771,
        204.762215,
        205.391848,
        272.162773,
        316.996074,
        352.906835,
        423.002191,
        448.381703,
        472.600775,
        481.927351,
        572.83641,
        593.052707,
        607.312959,
        647.293768
      ],
      "correct_ratio": 0.2,
      "GT": "The participant executed a trill between the C and the D beautifully, with the trill sounding clear and performed with a nice light touch.",
      "negative_comments": [
        "The participant executed an elaborate glissando between the C and the D beautifully, with the glissando sounding clear and performed with a nice light touch.",
        "The participant executed a trill between the C and the E beautifully, with the trill sounding clear and performed with a nice light touch.",
        "The participant executed a series of arpeggios on the left hand, with the arpeggios sounding clear and performed with a nice light touch.",
        "The participant added a delicate vibrato on the sustained notes, creating a charming effect."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0717_Piano_1_2",
      "recording": "4.webm",
      "video_time": 190.206928,
      "duration_approx": 13.821699999995529,
      "task_name": "Playing Piano - Scales and Arpeggios",
      "sorted_video_times": [
        6.909914,
        10.692927,
        12.161297,
        17.455438,
        22.177206,
        34.056121,
        42.434553,
        43.33891,
        50.960543,
        76.447096,
        85.809053,
        95.340131,
        96.361302,
        107.480357,
        114.029347,
        118.658136,
        131.16009,
        144.35105,
        159.826444,
        163.290275,
        166.899703,
        170.22581,
        190.206928,
        215.819419,
        217.340697,
        223.144315
      ],
      "correct_ratio": 0.2,
      "GT": "The expert appreciates the participant's choice to slow down, which allowed for correct pitches while maintaining an even tempo despite a slight hesitation.",
      "negative_comments": [
        "The participant's decision to speed up helped maintain correct pitches and an even tempo despite a slight hesitation.",
        "The expert notes the participant's choice to keep the pedal raised, allowing for an even tempo despite a slight hesitation.",
        "By using their left hand to outline the chord progressions, the participant ensured correct pitches and an even tempo.",
        "Switching to a lighter touch technique allowed for embellishments while maintaining an even tempo despite slight hesitation."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0724_Piano_1_4",
      "recording": "6.webm",
      "video_time": 137.461176,
      "duration_approx": 17.556299999952316,
      "task_name": "Playing Piano - Freeplaying",
      "sorted_video_times": [
        6.138516,
        10.380319,
        19.79672,
        37.392216,
        41.072305,
        45.459887,
        51.452256,
        57.221575,
        60.776169,
        63.253679,
        68.216986,
        74.104815,
        87.096346,
        103.757763,
        107.723747,
        108.682883,
        128.912981,
        137.461176,
        139.001757,
        143.537924,
        162.731311,
        174.271901,
        174.55793,
        180.895263,
        191.432449,
        193.312441,
        199.803904,
        207.793472,
        229.289237,
        240.144944,
        244.254935,
        247.101793,
        297.351959,
        320.932343,
        343.601656,
        347.64108,
        350.969542,
        355.806503
      ],
      "correct_ratio": 0.3,
      "GT": "The participant executed the descending arpeggio figure excellently, ensuring the notes were clear even with the pedal down by using very short articulation.",
      "negative_comments": [
        "The participant executed the descending arpeggio figure excellently, ensuring the notes were clear by avoiding the use of the pedal completely.",
        "The participant expertly handled the ascending scale, ensuring clarity by using very pronounced articulation with each finger.",
        "The participant used a powerful finger staccato technique to keep the arpeggio notes distinct and clear.",
        "By sustaining the upper harmony with the sustain pedal, the pianist ensured the clarity of the arpeggio."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0715_Piano_1_5",
      "recording": "5.webm",
      "video_time": 228.231465,
      "duration_approx": 36.454199999999254,
      "task_name": "Playing Piano",
      "sorted_video_times": [
        98.16349,
        143.792583,
        209.944988,
        228.231465,
        253.453772,
        355.804336
      ],
      "correct_ratio": 0.3,
      "GT": "The participant does a great job of keeping a beautiful, smooth aural texture throughout the piece.",
      "negative_comments": [
        "The pianist demonstrates excellent control, opting to maintain a consistent rhythmic structure throughout the piece.",
        "The pianist ensures a consistent aural texture by emphasizing each note with increased force.",
        "The pianist expertly switches between using the palm and the fingers to create a varied musical color palette.",
        "The pianist utilizes their shoulders prominently to control the volume and sustain the musical balance."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0722_Piano_1_2",
      "recording": "17.webm",
      "video_time": 166.408052,
      "duration_approx": 12.8485,
      "task_name": "Playing Piano - Scales and Arpeggios",
      "sorted_video_times": [
        5.252869,
        10.037811,
        10.08917,
        11.548989,
        15.874271,
        20.79157,
        26.096479,
        26.208751,
        26.780806,
        29.881409,
        30.144753,
        31.052076,
        33.595774,
        35.275266,
        38.576151,
        40.520688,
        42.851331,
        42.87054,
        49.333115,
        50.162363,
        50.836293,
        66.835377,
        74.97242,
        89.42098,
        114.166797,
        124.657093,
        125.822376,
        129.064211,
        142.106602,
        166.354474,
        166.408052,
        186.178691,
        189.420688,
        195.51112,
        206.723129,
        213.31839,
        218.077709,
        234.702857,
        235.015504,
        242.061458
      ],
      "correct_ratio": 0.2,
      "GT": "The participant maintained pitch accuracy and a clear sound throughout the scale, keeping their hands and fingers in very close proximity.",
      "negative_comments": [
        "The participant maintained pitch accuracy and a clear sound throughout the scale, using a full arm swing to emphasize dynamics.",
        "The participant maintained tonal balance and a bright timbre by crossing their fingers during each octave shift.",
        "The participant achieved pitch correctness by frequently lifting their hands quite high above the keys for dramatic effect.",
        "The participant ensured a seamless progression by standing up slightly for better reach on the lower notes."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0717_Piano_1_5",
      "recording": "10.webm",
      "video_time": 197.724109,
      "duration_approx": 14.47870000000298,
      "task_name": "Playing Piano",
      "sorted_video_times": [
        30.342152,
        34.434036,
        35.013962,
        35.627046,
        36.668963,
        37.579956,
        39.278624,
        39.648354,
        40.823889,
        40.823889,
        41.375004,
        53.616047,
        54.24039,
        55.048721,
        57.525882,
        79.093652,
        110.333801,
        110.333801,
        111.882075,
        118.467145,
        118.630818,
        158.996018,
        159.361455,
        161.634321,
        162.865969,
        162.865969,
        197.724109,
        198.688403,
        234.266182,
        257.94183,
        258.092764,
        258.092764,
        278.127958,
        283.227,
        285.103477,
        324.52355
      ],
      "correct_ratio": 0.3,
      "GT": "The participant accurately and precisely moved his hand to the correct position, ensuring his thumb reached the designated D note effectively.",
      "negative_comments": [
        "The participant skillfully adjusted his elbow to ensure his thumb reached the designated D note effectively.",
        "The participant consistently used his index finger to slide into the D note with precision and accuracy.",
        "The participant leaned in closer to the keys to enhance the depth of his reach to the D note.",
        "The participant lifted both hands off the keys entirely, ensuring clear preparation for reaching the D note."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0726_Piano_1_2",
      "recording": "39.webm",
      "video_time": 122.702692,
      "duration_approx": 6.2095,
      "task_name": "Playing Piano - Scales and Arpeggios",
      "sorted_video_times": [
        27.401062,
        27.531525,
        40.886185,
        42.521881,
        57.454359,
        62.405845,
        90.573847,
        93.84687,
        102.279768,
        116.788776,
        122.702692,
        128.564228,
        149.309845,
        214.925462
      ],
      "correct_ratio": 0.2,
      "GT": "The participant executed the descending portion of the scale with correct pitches.",
      "negative_comments": [
        "The participant executed the ascending portion of the scale with correct pitches.",
        "The participant executed the descending portion of the arpeggio with correct pitches.",
        "The participant used alternate fingerings to execute the scale with correct pitches.",
        "By adjusting the damper pedal, the participant ensured correct pitches throughout the scale."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0722_Piano_1_3",
      "recording": "0.webm",
      "video_time": 22.759014,
      "duration_approx": 14.987,
      "task_name": "Playing Piano - Suzuki Books",
      "sorted_video_times": [
        11.250099,
        13.761149,
        18.66126,
        19.417088,
        22.759014,
        42.829249,
        60.201645,
        61.717071,
        63.904464,
        66.39838,
        76.99466,
        84.430389,
        97.795972,
        100.931921,
        110.337417,
        138.370652,
        138.87205,
        154.037585,
        157.567294,
        184.532624,
        194.42706,
        208.070266,
        212.554736,
        233.807722,
        243.724444,
        246.899136,
        252.625528,
        255.111797,
        267.490859,
        268.299635,
        272.418573,
        274.675445,
        280.604547,
        288.839798,
        299.562906
      ],
      "correct_ratio": 0.3,
      "GT": "The pianist demonstrates great pitch and rhythmic accuracy in their performance.",
      "negative_comments": [
        "The pianist demonstrates great technique with their arpeggio speed, moving seamlessly between octaves.",
        "The pianist exhibits superb dynamic control, particularly by varying hand placements on the keys.",
        "The pianist's performance is enhanced by their intentional use of the soft pedal to maintain harmonic clarity.",
        "The pianist showcases excellent use of the sostenuto pedal to sustain certain harmonies while executing fast passages."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0701_Piano_2_7",
      "recording": "12.webm",
      "video_time": 248.210481,
      "duration_approx": 8.95970000000298,
      "task_name": "Playing Piano",
      "sorted_video_times": [
        43.442793,
        47.221212,
        58.385862,
        84.689161,
        86.839713,
        119.301038,
        126.922872,
        148.682345,
        161.155798,
        163.249304,
        172.00642,
        248.210481,
        264.213366,
        288.389389,
        294.085834
      ],
      "correct_ratio": 0.3,
      "GT": "The participant effectively extends their fingers to cover a wider range of notes when performing chords.",
      "negative_comments": [
        "The participant effectively curls their fingers to cover a wider range of notes when performing chords.",
        "The participant significantly bends their wrists downwards to reach a broader array of notes during the chord sequences.",
        "The participant utilizes their elbow movements prominently to enable a wider reach when playing the chords.",
        "By sliding their fingers across the keys rapidly, the participant achieves a broader tonal range for the chords."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0721_Piano_2_3",
      "recording": "16.webm",
      "video_time": 238.419235,
      "duration_approx": 10.880400000035763,
      "task_name": "Playing Piano - Suzuki Books",
      "sorted_video_times": [
        23.686993,
        29.141799,
        31.043948,
        33.628098,
        33.648134,
        37.420846,
        39.333442,
        42.080386,
        52.138677,
        59.755217,
        73.075427,
        78.703195,
        78.83068,
        80.218489,
        81.09231,
        88.985297,
        89.348884,
        93.309937,
        98.482592,
        103.483464,
        109.971552,
        111.198309,
        112.727293,
        119.977125,
        124.990126,
        134.892983,
        136.570809,
        143.046194,
        143.417702,
        144.605718,
        149.480285,
        158.407378,
        161.27583,
        162.848955,
        163.63801,
        166.812999,
        170.232146,
        172.147059,
        172.61816,
        172.715918,
        176.111786,
        189.827115,
        193.210811,
        200.544552,
        223.538398,
        224.937272,
        226.088773,
        230.061601,
        232.287547,
        236.047427,
        236.222841,
        237.954057,
        238.419235,
        251.264493,
        252.863046,
        256.042099,
        259.311369,
        266.655286,
        279.275166,
        281.209361,
        285.495375,
        311.672615,
        314.626964,
        322.463662
      ],
      "correct_ratio": 0.2,
      "GT": "The participant made sure not to overemphasize the last note and executed a gentle release at the end expressively.",
      "negative_comments": [
        "The participant made sure to overemphasize the last note and executed a forceful release at the end expressively.",
        "The participant used a sharp staccato to finish the phrase, creating a contrasting dynamic from the rest of the piece.",
        "The participant incorporated a swift pedal lift to highlight the final chord, giving it an unexpected resonance.",
        "By using cross-hand techniques, the participant ensured an expressive termination of the final melody line."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0720_Piano_1_5",
      "recording": "22.webm",
      "video_time": 605.329855,
      "duration_approx": 4.794699999999255,
      "task_name": "Playing Piano - Freeplaying",
      "sorted_video_times": [
        14.972047,
        21.939176,
        38.393231,
        73.71201,
        85.273623,
        94.879145,
        121.711205,
        168.434557,
        181.895077,
        197.686257,
        220.675677,
        266.721935,
        291.264028,
        356.639338,
        363.751621,
        388.530351,
        441.785122,
        565.305397,
        605.329855,
        647.974626,
        699.357979
      ],
      "correct_ratio": 0.3,
      "GT": "The participant does a good job creating a crescendo by putting more weight into the keyboard.",
      "negative_comments": [
        "The participant does a good job creating a crescendo by lightly tapping the keys to gradually increase volume.",
        "The participant achieves crescendo by using rapid finger lifts rather than pressing heavier into the keyboard.",
        "The participant adjusts the sustain pedal frequently to generate a smooth crescendo effect.",
        "By shifting their hand position higher up the keys, the participant successfully builds a crescendo."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0719_Piano_1_5",
      "recording": "3.webm",
      "video_time": 138.969723,
      "duration_approx": 14.29160000000149,
      "task_name": "Playing Piano",
      "sorted_video_times": [
        52.448417,
        119.499126,
        138.969723,
        356.177623
      ],
      "correct_ratio": 0.2,
      "GT": "The participant excels at keeping repeated notes even in tone and articulation.",
      "negative_comments": [
        "The participant excels at keeping repeated notes even by using their thumb for every note.",
        "The participant excels at creating variety in tone by deliberately changing the articulation of repeated notes.",
        "The participant achieves a uniform tone on repeated notes by frequently shifting pedal positions.",
        "The participant maintains an even tone on repeated notes by applying vibrato with their pinky finger."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0701_Piano_1_7",
      "recording": "2.webm",
      "video_time": 216.459792,
      "duration_approx": 6.95190000000014,
      "task_name": "Playing Piano",
      "sorted_video_times": [
        208.830208,
        216.459792,
        216.874729,
        233.367308,
        253.592942,
        264.072045
      ],
      "correct_ratio": 0.3,
      "GT": "The participant is effectively counting out loud as they play to maintain the correct tempo.",
      "negative_comments": [
        "The participant is effectively tapping their toes as they play to maintain the correct tempo.",
        "The participant is skillfully nodding their head to keep the time, ensuring consistent tempo throughout.",
        "The participant is glancing at the sheet music while humming to themselves to maintain the right tempo.",
        "The participant uses the metronome on their smartphone to maintain the steady pace as they play."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0721_Piano_1_5",
      "recording": "4.webm",
      "video_time": 327.254372,
      "duration_approx": 5.03689999999851,
      "task_name": "Playing Piano",
      "sorted_video_times": [
        267.659571,
        268.8555,
        288.212906,
        289.191392,
        290.570404,
        304.969138,
        327.254372
      ],
      "correct_ratio": 0.3,
      "GT": "The participant successfully used their wrist to play the octaves, achieving a smoother sound.",
      "negative_comments": [
        "The pianist demonstrates great technique, notably playing with their knuckles leading the motion to enable more efficient hand movement.",
        "The participant successfully used their elbow to play the octaves, achieving a smoother sound.",
        "The participant engages the knees to stabilize their performance, achieving a smoother sound.",
        "The participant employed a heel-to-toe foot technique to achieve a smoother sound while playing the octaves."
      ],
      "matched_with_original": true
    },
    {
      "take_name": "upenn_0717_Piano_3_5",
      "recording": "4.webm",
      "video_time": 130.570626,
      "duration_approx": 9.60770000000298,
      "task_name": "Playing Piano",
      "sorted_video_times": [
        130.570626,
        133.304428,
        160.432689,
        163.703414,
        164.353633,
        167.29451,
        168.467019,
        229.167201,
        230.24443,
        230.295252,
        230.62792
      ],
      "correct_ratio": 0.2,
      "GT": "The participant demonstrates resilience by continuing to play despite hitting a couple of incorrect notes in the left hand.",
      "negative_comments": [
        "The pianist demonstrates resilience by continuing to play despite hitting a couple of incorrect notes in the right hand.",
        "The pianist shows adaptability by adjusting their finger positioning on the white keys after hitting a couple of incorrect notes in the left hand.",
        "The pianist displays determination by using the sostenuto pedal to maintain the harmony after hitting incorrect notes.",
        "By switching to octaves after the mistake, the pianist exhibits quick problem-solving skills to create a fuller sound."
      ],
      "matched_with_original": true
    }
  ],
  "tips_samples": []
}